module Программа

open Фшарп.Ядро
open Funogram.Api
open Funogram.Telegram
open Funogram.Telegram.Bot
open Funogram.Types

let обробитиРезультатІзЗначенням (результат: Result<'a, ApiResponseError>) =
  match результат with
  | Ok з -> Some з
  | Error п ->
    напечататифн "Помилка сервера: %s" п.Description
    None

let цитати = [
    "якусь іншу вулицю перекрили.";
    "дороги поремонтували.";
    "дитячі садочки побудували.";
    "годинника додали.";
    "street написали.";
    "чорний фон та жовтий текст зробили.";
    "вагони поремонтували.";
    "зробили світлодіодну панель з переліком всіх станцій.";
    "ремонт в школах зробили.";
    "з парковкою розібрались.";
    "годинник час до прибуття поїзда показував.";
    "напис зробили, який світиться.";
    "застосунок для телефону зробили.";
    "зробили кращегенератор.";
    "лампочку вкрутили.";
    "сквера зробили.";
    "самі повкручували б табличку.";
    "карту на північ розвернули.";
    "нормальний сайт собі зробили.";
    "зробили, коли наступний поїзд.";
    "нормальну вентиляцію в вагонах зробили.";
    "нічого не міняли.";
    "свою Троєщину пішоходизували.";
    "метро на Виноградар побудували.";
    "синім на жовтому написали.";
    "нормальний громадський транспорт зробили.";
    "під’їзд відремонтували.";
    "метро на Троєщину побудували.";
    "ями в асфальті поремонтували.";
    "машину собі купили.";
    "чимось корисним зайнялись.";
    "жовтим на синьому написали.";
    "підсвітку зробили.";
]

let обробитиРезультат результат =
  обробитиРезультатІзЗначенням результат |> ігнорувати

let результатБота конфігурация дані = api конфігурация дані |> Async.RunSynchronously
let бот конфігурация дані = результатБота конфігурация дані |> обробитиРезультат

let текстВітання = "Краще б…\n"

let відправитиВітання ідЧата = 
    let текст = текстВітання + цитати[System.Random.Shared.Next(цитати.Length)]
    let командаВідправкиВітання = Api.sendMessage ідЧата текст
    [| командаВідправкиВітання |]

let трапилосьОновлення (ктк: UpdateContext) =
    let ізІд () = 
        match ктк.Update with
            | { CallbackQuery = cq; Message = m; MyChatMember = mcm } when Option.isSome cq && Option.isNone m && Option.isNone mcm ->
                cq.Value.From.Id
            | { CallbackQuery = cq; Message = m; MyChatMember = mcm } when Option.isNone cq && Option.isSome m && Option.isNone mcm ->
                m.Value.From.Value.Id
            | { CallbackQuery = cq; Message = m; MyChatMember = mcm } when Option.isNone cq && Option.isNone m && Option.isSome mcm ->
                mcm.Value.From.Id
            | _ -> провалитисяз "Непідтримуване повідомлення"

    let виконати команди = 
        команди
        |> Масив.ітер (fun кмд -> бот ктк.Config кмд)
  
    let ідЧата = ізІд ()
    let результат =
      processCommands ктк [|
        // Car bot
        cmd "/start" (fun _ -> відправитиВітання ідЧата |> виконати)
      |]
    if результат then 
        відправитиВітання ідЧата |> виконати
    else
        ()

[<EntryPoint>]
let main _ =
    асинх {
        let конфигурація = Config.defaultConfig |> Config.withReadTokenFromFile
        let! _ = Api.deleteWebhookBase () |> api конфигурація
        if конфигурація.Token = "" then провалитисяз "Токен не указан"
        напечататифн "Бот стартує"
        return! startBot конфигурація трапилосьОновлення None
    } |> Асинх.ВиконатиСинхронно
    0